def ar1():
    a = int(input("Введите ширину прямоугольника: "))
    b = int(input("Введите длину прямоугольника: "))
    return a * b


def ar2():
    a = int(input("Введите высоту треугольника: "))
    b = int(input("Введите ширину основания треугольника: "))
    return (a * b) / 2


def ar3():
    a = int(input("Введите радиус круга: "))
    return 3.14 * a ** 2


print("Выбор фигуры: \t\n1-прямоугольник\t\n2-треугольник\t\n3-круг")
x = int(input(": "))

if x == 1:
    print(ar1())
elif x == 2:
    print(ar2())
elif x == 3:
    print(ar3())

else:
    print("Введено не верное исходное условие геометрической фигуры!!!")
